//======================================================================================
//视图的事件，请不要在这里修改代码，修改的代码会被覆盖
//======================================================================================

/*==================================onclick='viewAction()'事件==================================*/
function viewAction(){
   viewEmcAaction();
}

/*==================================onclick='flushAction()'事件==================================*/
function flushAction(){
   flushActionDatas();
}

/*==================================onclick='updateAction()'事件==================================*/
function  updateAction(){
	actionEdit();
}

/*==================================afterSave事件==================================*/


/*==================================afterSubmit事件==================================*/


/*==================================beforeSave事件==================================*/


/*==================================beforeSubmit事件==================================*/


/*==================================onload事件==================================*/
var SESECD_ecdPanel_ecdAction_onload = function(){
	var getaEventId = ReactAPI.getParamsInRequestUrl().eventId;
getEmcAtionInfo(getaEventId);
}

/*==================================onsave事件==================================*/
var SESECD_ecdPanel_ecdAction_onsave = function(){
	
}

