//======================================================================================
//视图的事件，请不要在这里修改代码，修改的代码会被覆盖
//======================================================================================

/*==================================afterSave事件==================================*/


/*==================================afterSubmit事件==================================*/


/*==================================beforeSave事件==================================*/


/*==================================beforeSubmit事件==================================*/


/*==================================onload事件==================================*/
var SESECD_alarmRecord_accident_onload = function(){
	var style = document.createElement('style');style.innerHTML = ".list-checkbox {display:none!important}";window.document.head.appendChild(style);
}

/*==================================onsave事件==================================*/
var SESECD_alarmRecord_accident_onsave = function(){
	
}

